cmsis-svd/cmsis-svd/data/NordicSemi/nrf52820.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SWI0</name>
      <description>Software interrupt 0</description>
      <baseAddress>0x40014000</baseAddress>
      <alternatePeripheral>EGU0</alternatePeripheral>
      <headerStructName>SWI</headerStructName>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SWI0_EGU0</name>
        <value>20</value>
      </interrupt>
      <groupName>SWI</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>UNUSED</name>
          <description>Unused.</description>
          <addressOffset>0x000</addressOffset>
          <resetValue>0x00000000</resetValue>
          <access>read-only</access>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="EGU0">
      <name>EGU1</name>
      <description>Event generator unit 1</description>
      <baseAddress>0x40015000</baseAddress>
      <interrupt>
        <name>SWI1_EGU1</name>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0">
      <name>SWI1</name>
      <description>Software interrupt 1</description>
      <baseAddress>0x40015000</baseAddress>
      <alternatePeripheral>EGU1</alternatePeripheral>
      <interrupt>
        <name>SWI1_EGU1</name>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0">
      <name>EGU2</name>
      <description>Event generator unit 2</description>
      <baseAddress>0x40016000</baseAddress>
      <interrupt>
        <name>SWI2_EGU2</name>
        <value>22</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0">
      <name>SWI2</name>
      <description>Software interrupt 2</description>
      <baseAddress>0x40016000</baseAddress>
      <alternatePeripheral>EGU2</alternatePeripheral>
      <interrupt>
        <name>SWI2_EGU2</name>
        <value>22</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0">
      <name>EGU3</name>
      <description>Event generator unit 3</description>
      <baseAddress>0x40017000</baseAddress>
      <interrupt>
        <name>SWI3_EGU3</name>
        <value>23</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0">
      <name>SWI3</name>
      <description>Software interrupt 3</description>
      <baseAddress>0x40017000</baseAddress>
      <alternatePeripheral>EGU3</alternatePeripheral>
      <interrupt>
        <name>SWI3_EGU3</name>
        <value>23</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0">
      <name>EGU4</name>
      <description>Event generator unit 4</description>
      <baseAddress>0x40018000</baseAddress>
      <interrupt>
        <name>SWI4_EGU4</name>
        <value>24</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0">
      <name>SWI4</name>
      <description>Software interrupt 4</description>
      <baseAddress>0x40018000</baseAddress>
      <alternatePeripheral>EGU4</alternatePeripheral>
      <interrupt>
        <name>SWI4_EGU4</name>
        <value>24</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0">
      <name>EGU5</name>
      <description>Event generator unit 5</description>
      <baseAddress>0x40019000</baseAddress>
      <interrupt>
        <name>SWI5_EGU5</name>
        <value>25</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0">
      <name>SWI5</name>
      <description>Software interrupt 5</description>
      <baseAddress>0x40019000</baseAddress>
      <alternatePeripheral>EGU5</alternatePeripheral>
      <interrupt>
        <name>SWI5_EGU5</name>
        <value>25</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER3</name>
      <description>Timer/Counter 3</description>
      <baseAddress>0x4001A000</baseAddress>
      <interrupt>
        <name>TIMER3</name>
        <value>26</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ACL</name>
      <description>Access control lists</description>
      <baseAddress>0x4001E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>ACL</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x010</dimIncrement>
          <name>ACL[%s]</name>
          <description>Unspecified</description>
          <headerStructName>ACL_ACL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>ADDR</name>
            <description>Description cluster: Start address of region to protect. The start address must be word-aligned.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Start address of flash region n. The start address must point to a flash page boundary.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SIZE</name>
            <description>Description cluster: Size of region to protect counting from address ACL[n].ADDR. Write '0' as no effect.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SIZE</name>
                <description>Size of flash region n in bytes. Must be a multiple of the flash page size.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PERM</name>
            <description>Description cluster: Access permissions for region n as defined by start address ACL[n].ADDR and size ACL[n].SIZE</description>
            <addressOffset>0x008</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>WRITE</name>
                <description>Configure write and erase permissions for region n. Write '0' has no effect.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow write and erase instructions to region n</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block write and erase instructions to region n</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>READ</name>
                <description>Configure read permissions for region n. Write '0' has no effect.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow read instructions to region n</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block read instructions to region n</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
